Repository: sinfallas/live-manual
Catalog: manual/po/*/appendix_style-guide.ssi.po
Languages: ca

source: Documents written in English make an extensive use of the impersonal form "you". In some other languages that do not share this characteristic, this might give the false impression that the original texts are directly addressing the reader when they are actually not doing so. Translators must be aware of that fact and reflect it in their language as accurately as possible.
ca: Els documents escrits en anglès fan un gran ús de la forma impersonal "you". En alguns altres idiomes que no comparteixen aquesta característica, això pot donar la falsa impressió que els textos originals s'adresen directament el lector quan en realitat n'ho fan. Els traductors han de ser conscients d'aquest fet i ho han de reflectir en el seu idioma amb la major precisió possible.

source: _* /{False friends}/
ca: _* /{Falsos amics}/

source: The trap of "false friends" explained before especially applies to translators. Double check the meaning of suspicious false friends if in doubt.
ca: El perill dels "falsos amics" explicat anteriorment s'aplica especialment als traductors. Tornar a comprovar el significat dels falsos amics sospitosos en cas de dubte.

source: Translators working initially with *{pot}* files and later on with *{po}* files will find many markup features in the strings. They can translate the text anyway, as long as it is translatable, but it is extremely important that they use exactly the same markup as the original English version.
ca: Els traductors que treballin inicialment amb els fitxers *{pot}* i posteriorment amb els fitxers *{po}* trobaràn moltes característiques de marcat en les cadenes. Es pot traduir el text, sempre que sigui traduïble, però és extremadament important que s'utilitzi exactament el mateix marcat que a la versió original en anglès.

source: _* /{Code blocks}/
ca: _* /{Blocs de codi}/

source: Even though the code blocks are usually untranslatable, including them in the translation is the only way to score a 100% complete translation. And even though it means more work at first because it might require the intervention of the translators if the code changes, it is the best way, in the long run, to identify what has already been translated and what has not when checking the integrity of the .po files.
ca: Tot i que els blocs de codi són generalment intraduïbles, incloure'ls en la traducció és l'única manera de conseguir una traducció completa al 100%. I encara que això signifiqui més feina al principi, ja que pot requerir la intervenció dels traductors s'hi ha canvis en el codi, és la millor manera, a la llarga, per identificar el que s'ha traduït i el que no al comprovar la integritat dels fitxers .po.

source: _* /{Newlines}/
ca: _* /{Salts de línia}/

source: The translated texts need to have the exact same newlines as the original texts. Be careful to press the "Enter" key or type *{\n}* if they appear in the original files. These newlines often appear, for instance, in the code blocks.
ca: Els texts traduïts han de tenir exactament els mateixos salts de línia que els texts originals. Aneu amb compte de pressionar la tecla "Enter" o escriure *{\n}* si apareix als fitxers originals. Aquests salts de línies apareixen sovint, per exemple, en els blocs de codi.

source: Make no mistake, this does not mean that the translated text needs to have the same length as the English version. That is nearly impossible.
ca: No confondre's, això no vol dir que el text traduït hagi de tenir la mateixa longitud que la versió en anglès. Aixó és gairebé impossible.

source: _* /{Untranslatable strings}/
ca: _* /{Cadenes intraduïbles}/

source: Translators should never translate:
ca: Els traductors no han de traduir mai:

source: The code names of releases (which should be written in lowercase)
ca: Els noms en clau de les versions (que han de ser escrits en minúscules)

source: The names of programs
ca: Els noms dels programes

source: The commands given as examples
ca: Les ordres que es posen com a exemples

source: Metadata (often between colons *{:metadata:}*)
ca: Les metadades (apareixen sovint entre dos punts *{:metadata:}*)

source: Links
ca: Els enllaços

source: Paths
ca: Les rutes
