Repository: sinfallas/live-manual
Catalog: manual/po/*/appendix_style-guide.ssi.po
Languages: ca

source: 1~style-guide Style guide
ca: 1~style-guide Guia d'estil

source: 2~ Guidelines for authors
ca: 2~ Instruccions per als autors

source: This section deals with some general considerations to be taken into account when writing technical documentation for live-manual. They are divided into linguistic features and recommended procedures.
ca: Aquesta secció s'ocupa d'algunes consideracions generals a tenir en compte al escriure documentació tècnica per a live-manual. Es divideixen en aspectes lingüístics i procediments recomanats.

source: *{Note:}* Authors should first read {Contributing to this document}#how-to-contribute
ca: *{Nota:}* Els autors han de llegir primer {Contribuir a aquest document}#how-to-contribute

source: 3~ Linguistic features
ca: 3~ Característiques lingüístiques

source: _* /{Use plain English}/
ca: _* /{Utilitzar un anglès planer}/

source: Keep in mind that a high percentage of your readers are not native speakers of English. So as a general rule try to use short, meaningful sentences, followed by a full stop.
ca: Tenir en compte que un alt percentatge dels lectors no són parlants nadius d'anglès. Així que, com a regla general, intentar utilitzar frases curtes i significatives, seguides d'un punt i apart.

source: This does not mean that you have to use a simplistic, naive style. It is a suggestion to try to avoid, as much as possible, complex subordinate sentences that make the text difficult to understand for non-native speakers of English.
ca: Això no vol dir que s'hagi d'utilitzar un estil simplista i ingenu. És un suggeriment per intentar evitar, en la mesura del possible, les oracions subordinades complexes que fan que el text sigui difícil d'entendre per als parlants no nadius d'anglès.

source: _* /{Variety of English}/
ca: _* /{Varietat d'anglès}/

source: The most widely spread varieties of English are British and American so it is very likely that most authors will use either one or the other. In a collaborative environment, the ideal variety would be "International English" but it is very difficult, not to say impossible, to decide on which variety among all the existing ones, is the best to use.
ca: Les varietats d'anglès més esteses són el britànic i l'americà, així que és molt probable que la majoria dels autors acabin utilitzant l'una o l'altra. En un entorn de col·laboració, la varietat ideal seria "l'anglès internacional", però és molt difícil, per no dir impossible, decidir quina varietat d'entre totes les existents, és la millor.

source: We expect that different varieties may mix without creating misunderstandings but in general terms you should try to be coherent and before deciding on using British, American or any other English flavour at your discretion, please take a look at how other people write and try to imitate them.
ca: Esperem que les diferents varietats es puguin barrejar sense crear malentesos, però en termes generals s'ha d'intentar ser coherent i abans de decidir sobre l'ús de l'anglès britànic, l'anglès americà o qualsevol altra varietat, fer una ullada a com escriuen altres persones i tractar d'imitar l'estil.

source: _* /{Be balanced}/
ca: _* /{Ser equilibrat}/

source: Do not be biased. Avoid including references to ideologies completely unrelated to live-manual. Technical writing should be as neutral as possible. It is in the very nature of scientific writing.
ca: S'ha de ser imparcial. Evitar incloure referències a ideologies totalment alienes a live-manual. L'escriptura tècnica ha de ser el més neutral possible. Està en la naturalesa mateixa de l'escriptura científica.

source: _* /{Be politically correct}/
ca: _* /{Ser políticament correcte}/

source: Try to avoid sexist language as much as possible. If you need to make references to the third person singular preferably use "they" rather than "he" or "she" or awkward inventions such as "s/he", "s(he)" and the like.
ca: Evitar el llenguatge sexista tant com sigui possible. Si es necessita fer referència a la tercera persona del singular utilitzar preferiblement "they" en lloc de "he" or "she" o invents estranys com per exemple "s/he" o "s(he)".

source: _* /{Be concise}/
ca: _* /{Ser concís}/

source: Go straight to the point and do not wander around aimlessly. Give as much information as necessary but do not give more information than necessary, this is to say, do not explain unnecessary details. Your readers are intelligent. Presume some previous knowledge on their part.
ca: Anar directament al gra i no fent voltes. Donar tota la informació necessària, però no afegir més informació de la necessària, és a dir, no explicar detalls innecessaris. Els lectors són intel·ligents. Es presumeix algun coneixement previ per la seva part.

source: _* /{Minimize translation work}/
ca: _* /{Minimitzar la feina de traducció}/

source: Keep in mind that whatever you write will have to be translated into several other languages. This implies that a number of people will have to do an extra work if you add useless or redundant information.
ca: Tenir en compte que qualsevol cosa que s'escrigui haurà de ser traduida a diverses llengües. Això implica que un nombre de persones hauran de fer un treball extra si s'agrega informació innecessària o redundant.

source: _* /{Be coherent}/
ca: _* /{Ser coherent}/

source: As suggested before, it is almost impossible to standardize a collaborative document into a perfectly unified whole. However, every effort on your side to write in a coherent way with the rest of the authors will be appreciated.
ca: Com s'ha suggerit abans, és gairebé impossible estandarditzar un document escrit en col·laboració en un tot perfectament unificat. No obstant això, s'aprecia tot esforç per escriure d'una manera coherent amb la resta dels autors.

source: _* /{Be cohesive}/
ca: _* /{Cohesió}/

source: Use as many text-forming devices as necessary to make your text cohesive and unambiguous. (Text-forming devices are linguistic markers such as connectors).
ca: Utilitzar connectors del discurs perquè el text sigui coherent i sense ambigüitats. (Normalment s'anomenen connectors).

source: _* /{Be descriptive}/
ca: _* /{Ser descriptiu}/

source: It is preferable to describe the point in one or several paragraphs than merely using a number of sentences in a typical "changelog" style. Describe it! Your readers will appreciate it.
ca: És preferible descriure l'assumpte en un o diversos paràgrafs en lloc d'utilitzar una sèrie de oracions en un típic estil de "changelog". Cal descriure-ho! Els Lectors ho agrairan.

source: _* /{Dictionary}/
ca: _* /{Diccionari}/

source: Look up the meaning of words in a dictionary or encyclopedia if you do not know how to express certain concepts in English. But keep in mind that a dictionary can either be your best friend or can turn into your worst enemy if you do not know how to use it correctly.
ca: Buscar el significat de les paraules en un diccionari o una enciclopèdia si no es sap com expressar certs conceptes en anglès. Però cal tenir en compte que un diccionari pot ser el millor amic o pot convertir-se en el pitjor enemic si no es sap com utilitzar-lo correctament.

source: English has the largest vocabulary that exists (with over one million words). Many of these words are borrowings from other languages. When looking up the meaning of words in a bilingual dictionary the tendency of a non-native speaker of English is to choose the one that sounds more similar in their mother tongue. This often turns into an excessively formal discourse which does not sound quite natural in English.
ca: L'anglès té el vocabulari més gran que existeix (amb més d'un milió de paraules). Moltes d'aquestes paraules són préstecs d'altres llengües. Al buscar el significat de les paraules en un diccionari bilingüe la tendència d'un parlant no nadiu d'anglès és triar la que sona més semblant en la seva llengua materna. Sovint, això es converteix en un discurs excessivament formal que no sona ben natural en anglès.

source: As a general rule, if a concept can be expressed using different synonyms, it is a good advice to choose the first word proposed by the dictionary. If in doubt, choosing words of Germanic origin (Usually monosyllabic words) is often the right thing to do. Be warned that these two techniques might produce a rather informal discourse but at least your choice of words will be of wide use and generally accepted.
ca: Com a regla general, si un concepte es pot expressar utilitzant diferents sinònims, és un bon consell triar la primera paraula proposada pel diccionari. En cas de dubte, és sovint correcte elegir les paraules d'origen germànic (Normalment paraules monosíl·labes). Tenir en compte que aquestes dues tècniques poden produir un discurs més aviat informal, però almenys la elecció de paraules serà d'ampli ús i acceptació general.

source: Using a dictionary of collocations is recommended. They are extremely helpful when it comes to know which words usually occur together.
ca: L'ús d'un diccionari de frases fetes es recomanable. Són molt útils quan es tracta de saber quines paraules solen aparèixer juntes.

source: Again it is a good practice to learn from the work of others. Using a search engine to check how other authors use certain expressions may help a lot.
ca: Com s'ha dit abans, és una bona pràctica aprendre del treball dels altres. L'ús d'un motor de recerca per comprovar com altres autors utilitzen certes expressions pot ajudar molt.

source: _* /{False friends, idioms and other idiomatic expressions}/
ca: _* /{Falsos amics, modismes i altres expressions idiomàtiques}/

source: Watch out for false friends. No matter how proficient you are in a foreign language you cannot help falling from time to time in the trap of the so called "false friends", words that look similar in two languages but whose meanings or uses might be completely different.
ca: Compte amb els falsos amics. No importa com de competent un és en un idioma estranger, de tant en tant es pot caure en el parany dels anomenats "falsos amics", paraules que s'assemblen en dos idiomes però els significats o usos poden ser completament diferents.

source: Try to avoid idioms as much as possible. "Idioms" are expressions that may convey a completely different meaning from what their individual words seem to mean. Sometimes, idioms might be difficult to understand even for native speakers of English!
ca: Intentar evitar els modismes tant com sigui possible. Els "modismes " són expressions que tenen un significat completament diferent del que les seves paraules per separat semblen voler dir. De vegades, els modismes poden ser difícils d'entendre fins i tot per als parlants nadius d'anglès!

source: _* /{Avoid slang, abbreviations, contractions...}/
ca: _* /{Evitar l'argot, les abreviatures, les contraccions...}/

source: Even though you are encouraged to use plain, everyday English, technical writing belongs to the formal register of the language.
ca: Tot i que s'anima a utilitzar un anglès senzill i planer, l'escriptura tècnica pertany al registre formal de la llengua.

source: Try to avoid slang, unusual abbreviations that are difficult to understand and above all contractions that try to imitate the spoken language. Not to mention typical irc and family friendly expressions.
ca: Intentar evitar l'argot, les abreviatures inusuals que són difícils d'entendre i per sobre de tot, les contraccions que tracten d'imitar el llenguatge parlat. Per no parlar d'expressions familiars o típiques de l'irc.

source: 3~ Procedures
ca: 3~ Procediments

source: _* /{Test before write}/
ca: _* /{Provar abans d'escriure}/

source: It is important that authors test their examples before adding them to live-manual to ensure that everything works as described. Testing on a clean chroot or VM can be a good starting point. Besides, it would be ideal if the tests were then carried out on different machines with different hardware to spot possible problems that may arise.
ca: És important que els autors provin els seus exemples abans d'afegir-los a live-manual per assegurar-se que tot funciona com es descriu. Fer les proves en un entorn chroot net o en una màquina virtual pot ser un bon punt de partida. A més, seria ideal si les proves fossin dutes a terme en diferents ordinadors amb un maquinari diferent per detectar els possibles problemes que puguin sorgir.

source: _* /{Examples}/
ca: _* /{Exemples}/

source: When providing an example try to be as specific as you can. An example is, after all, just an example.
ca: Quan es posa un exemple mirar de ser el més específic possible. Un exemple és, després de tot, només un exemple.

source: It is often better to use a line that only applies to a specific case than using abstractions that may confuse your readers. In this case you can provide a brief explanation of the effects of the proposed example.
ca: Sovint és millor utilitzar una línia que només s'aplica a un cas concret que l'ús d'abstraccions que poden confondre als lectors. En aquest cas es pot donar una breu explicació dels efectes de l'exemple proposat.

source: There may be some exceptions when the example suggests using some potentially dangerous commands that, if misused, may cause data loss or other similar undesirable effects. In this case you should provide a thorough explanation of the possible side effects.
ca: Hi pot haver algunes excepcions quan l'exemple suggereixi l'ús d'algunes ordres potencialment perilloses que, si s'utilitzen incorrectament, poden provocar la pèrdua de dades o altres efectes indesitjables similars. En aquest cas, s'haurà de proporcionar una explicació detallada sobre els possibles efectes secundaris.

source: _* /{External links}/
ca: _* /{Enllaços externs}/

source: Links to external sites should only be used when the information on those sites is crucial when it comes to understanding a special point. Even so, try to use links to external sites as sparsely as possible. Internet links are likely to change from time to time resulting in broken links and leaving your arguments in an incomplete state.
ca: Els enllaços a llocs externs només s'han d'utilitzar quan la informació en aquests llocs és crucial per a comprendre un punt especial. Tot i això, intentar utilitzar els enllaços a llocs externs el menys possible. Els enllaços d'internet poden canviar de tant en tant, donant lloc a enllaços trencats i deixant els arguments en un estat incomplet.

source: Besides, people who read the manual offline will not have the chance to follow those links.
ca: A més, la gent que llegeix el manual sense connexió no podrà seguir els enllaços.

source: _* /{Avoid branding and things that violate the license under which the manual is published}/
ca: _* /{Evitar les marques i les coses que violen la llicència sota la qual es publica el manual}/

source: Try to avoid branding as much as possible. Keep in mind that other downstream projects might make use of the documentation you write. So you are complicating things for them if you add certain specific material.
ca: Intentar evitar les marques tant com sigui possible. Tenir en compte que altres projectes derivats poden fer ús de la documentació que escrivim. Així que estem complicant les coses per a ells si s'afegix determinat material específic.

source: live-manual is licensed under the GNU GPL. This has a number of implications that apply to the distribution of the material (of any kind, including copyrighted graphics or logos) that is published with it.
ca: live-manual es publica sota la llicència GNU GPL. Això té una sèrie d'implicacions que s'apliquen a la distribució dels materials (de qualsevol tipus, incloent-hi gràfics o logotips amb drets d'autor) que es publica amb ell.

source: _* /{Write a first draft, revise, edit, improve, redo if necessary}/
ca: _* /{Escriure un primer esborrany, revisar, editar, millorar, fer de nou si és necessari}/

source: Brainstorm!. You need to organize your ideas first in a logical sequence of events.
ca: Pluja d'idees!. Es necessari organitzar les idees primer en una seqüència lògica d'esdeveniments.

source: Once you have somehow organized those ideas in your mind write a first draft.
ca: Quan d'alguna manera ja s'han organitzat aquestes idees en la ment, escriure un primer esborrany.

source: Revise grammar, syntax and spelling. Keep in mind that the proper names of the releases, such as ${testing} or sid, should not be capitalized when referred to as code names. In order to check the spelling you can run the "spell" target. i.e. #{make spell}#
ca: Revisar la gramàtica, la sintaxi i l'ortografia. Tenir en compte que els noms propis de les versions, com ara ${testing} o sid, no s'han d'escriure en majúscula quan es refereixen als noms en clau. Per tal de comprovar l'ortografia es pot executar el target "spell". És a dir, #{make spell}#

source: Improve your statements and redo any part if necessary.
ca: Millorar les frases i refer qualsevol part si és necessari.

source: _* /{Chapters}/
ca: _* /{Capítols}/

source: Use the conventional numbering system for chapters and subtitles. e.g. 1, 1.1, 1.1.1, 1.1.2 ... 1.2, 1.2.1, 1.2.2 ... 2, 2.1 ... and so on. See markup below.
ca: Utilitzar el sistema de numeració convencional dels capítols i subtítols. Per exemple 1, 1.1, 1.1.1, 1.1.2 ... 1.2, 1.2.1, 1.2.2 ... 2, 2.1 ... i així successivament. Veure marcat a continuació.

source: If you have to enumerate a series of steps or stages in your description, you can also use ordinal numbers: First, second, third ... or First, Then, After that, Finally ... Alternatively you can use bulleted items.
ca: Si s'ha d'enumerar una sèrie de passos o etapes en la descripció, també es poden utilitzar els nombres ordinals: primer, segon, tercer ... o en primer lloc, llavors, després, per fi ... Alternativament, es poden utilitzar punts.

source: _* /{Markup}/
ca: _* /{Marcat}/

source: And last but not least, live-manual uses {SiSU}http://www.sisudoc.org/ to process the text files and produce a multiple format output. It is recommended to take a look at {SiSU's manual}http://www.sisudoc.org/sisu/en/html/sisu_manual/markup.html to get familiar with its markup, or else type:
ca: I per últim però no menys important, live-manual utilitza {SiSU}http://www.sisudoc.org/ per processar els fitxers de text i produir múltiples formats. Es recomana fer una ullada al {manual de SiSU}http://www.sisudoc.org/sisu/en/html/sisu_manual/markup.html per a familiaritzar-se amb el seu marcat, o bé escriure:

source: Here are some markup examples that may prove useful:
ca: Aquests són alguns exemples de marcat que poden ser útils:

source: For emphasis/bold text:
ca: Per a l'èmfasi/negreta:

source: *{foo}* or !{foo}!
ca: *{foo}* o !{foo}!

source: produces: *{foo}* or !{foo}!. Use it to emphasize certain key words.
ca: produeixen: *{foo}* o !{foo}!. S'usen per emfatitzar certes paraules clau.

source: For italics:
ca: Per a la cursiva:

source: produces: /{foo}/. Use them e.g. for the names of Debian packages.
ca: produeix: /{foo}/. S'usa, per exemple, per als noms dels paquets Debian.

source: For monospace:
ca: Per a monospace:

source: produces: #{foo}#. Use it e.g. for the names of commands. And also to highlight some key words or things like paths.
ca: produeix: #{foo}#. S'usa per exemple, per als noms de les ordres. I també per ressaltar algunes paraules clau o coses com les rutes.

source: For code blocks:
ca: Per a blocs de codi:

source: produces:
ca: produeix:

source: Use #{code{}# to open and #{}code}# to close the tags. It is important to remember to leave a space at the beginning of each line of code.
ca: S'utilitza #{code{}# per a obrir i #{}code}# per a tancar els blocs. És important recordar deixar un espai al principi de cada línia de codi.

source: 2~guidelines-translators Guidelines for translators
ca: 2~guidelines-translators Directrius per als traductors

source: This section deals with some general considerations to be taken into account when translating the contents of live-manual.
ca: Aquesta secció s'ocupa d'algunes consideracions generals a tenir en compte a l'hora de traduir el contingut de live-manual.

source: As a general recommendation, translators should have read and understood the translation rules that apply to their specific languages. Usually, translation groups and mailing lists provide information on how to produce translated work that complies with Debian quality standards.
ca: Com a recomanació general, els traductors haurien d'haver llegit i entès les regles de traducció que s'apliquen als seus llenguatges específics. En general, els grups de traductors i les llistes de correu proporcionen informació sobre com produir traduccions que compleixin amb els estàndards de qualitat de Debian.

source: *{Note:}* Translators should also read {Contributing to this document}#how-to-contribute. In particular the section {Translation}#translation
ca: *{Nota:}* Els traductors també han de llegir {Contribuir a aquest document}#how-to-contribute. En particular, la secció {Traducció}#translation

source: 3~ Translation hints
ca: 3~ Consells de traducció

source: _* /{Comments}/
ca: _* /{Comentaris}/

source: The role of the translator is to convey as faithfully as possible the meaning of words, sentences, paragraphs and texts as written by the original authors into their target language.
ca: El paper del traductor és transmetre el més fidelment possible el significat de les paraules, oracions, paràgrafs i textos de com van ser escrits pels autors originals al seu idioma.

source: So they should refrain from adding personal comments or extra bits of information of their own. If they want to add a comment for other translators working on the same documents, they can leave it in the space reserved for that. That is, the header of the strings in the *{po}* files preceded by a number sign *{#}*. Most graphical translation programs can automatically handle those types of comments.
ca: Per tant, aquests, s'han d'abstenir d'afegir comentaris personals o informacions addicionals pel seu compte. Si es vol afegir un comentari per als traductors que treballen en els mateixos documents, es poden deixar a l'espai reservat per a això. És a dir, la capçalera de les cadenes dels fitxers *{po}* precedits pel signe *{#}*. La majoria dels programes gràfics de traducció poden manejar aquest tipus de comentaris automàticament.

source: _* /{TN, Translator's Note}/
ca: _* /{NT, Nota del Traductor}/

source: It is perfectly acceptable however, to include a word or an expression in brackets in the translated text if, and only if, that makes the meaning of a difficult word or expression clearer to the reader. Inside the brackets the translator should make evident that the addition was theirs using the abbreviation "TN" or "Translator's Note".
ca: És perfectament acceptable però, incloure una paraula o una expressió entre parèntesi en el text traduït si, i només si, aixó fa que el significat d'una paraula o expressió difícil sigui més clara per al lector. Dins dels parèntesis, el traductor ha de posar de manifest que l'addició és seva utilitzant l'abreviatura "NT" o "Nota del traductor".

source: _* /{Impersonal sentences}/
ca: _* /{Frases impersonals}/
