Repository: sinfallas/live-manual
Catalog: manual/po/*/index.html.*.po
Languages: de

source: Live Systems Project
de: Live Systems Projekt

source: Live Systems Manual
de: Live Systems Handbuch

source: <i>live-manual</i> is available in different file formats and it is translated into several languages. Keep in mind that some translations may be incomplete or may not be up to date.
de: <i>live-manual</i> ist in verschiedenen Dateiformaten und Übersetzungen in mehrere Sprachen verfügbar, jedoch können manche Übersetzungen teilweise unvollständig oder nicht immer aktuell sein.

source: Please report errors, omissions, patches and suggestions to our mailing list at <a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a> and read about <a href="html/live-manual.en.html#how-to-contribute">how to contribute</a> to the manual.
de: Fehler, Vergessenes, Patches und Vorschläge können an unsere Mailing Liste unter <a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a> (englischspraching) gemeldet werden. Informationen wie man <a href="html/live-manual.de.html#how-to-contribute">zum Handbuch beitragen</a> kann, können im Handbuch gefunden werden.

source: Available Formats
de: Verfügbare Formate

source: <a href="epub/live-manual.en.epub">EPUB</a>
de: <a href="epub/live-manual.de.epub">EPUB</a>

source: HTML: <a href="html/live-manual/toc.en.html">multi page</a>, <a href="html/live-manual.en.html">single page</a>
de: HTML: <a href="html/live-manual/toc.de.html">mehrere Seiten</a>, <a href="html/live-manual.de.html">einzelne Seite</a>

source: <a href="odt/live-manual.en.odt">ODF</a>
de: <a href="odt/live-manual.de.odt">ODF</a>

source: PDF: <a href="pdf/live-manual.portrait.en.a4.pdf">A4 portrait</a>, <a href="pdf/live-manual.landscape.en.a4.pdf">A4 landscape</a>, <a href="pdf/live-manual.portrait.en.letter.pdf">letter portrait</a>, <a href="pdf/live-manual.landscape.en.letter.pdf">letter landscape</a>
de: PDF: <a href="pdf/live-manual.portrait.de.a4.pdf">A4 Hochformat</a>, <a href="pdf/live-manual.landscape.de.a4.pdf">A4 Querformat</a>, <a href="pdf/live-manual.portrait.de.letter.pdf">Letter Hochformat</a>, <a href="pdf/live-manual.landscape.de.letter.pdf">Letter Querformat</a>

source: <a href="txt/live-manual.en.txt">Plain text</a>
de: <a href="txt/live-manual.de.txt">Text</a>

source: Last changed: @DATE_CHANGE@
de: Letzte Änderung: @DATE_CHANGE@

source: Last built: @DATE_BUILD@
de: Letzte Aktualisierung: @DATE_BUILD@

source: Source
de: Quellen

source: The sources for this manual are available in a <a href="http://git-scm.com/">Git</a> repository at live-systems.org.
de: Die Quellen dieses Handbuches sind in einem <a href="http://git-scm.com/">Git</a> Repository auf live-systems.org verfügbar.

source: <a href="http://live-systems.org/">Live Systems Project</a> &lt;<a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a>&gt; - <a href="http://live-systems.org/project/legal/">Legal Information</a>
de: <a href="http://live-systems.org/">Debian Live</a> &lt;<a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a>&gt; - <a href="http://live-systems.org/project/legal/">Rechtliche Informationen</a>
