Repository: sinfallas/live-manual
Catalog: manual/po/*/project_contributing.ssi.po
Languages: it

source: :B~ Contributing to the project
it: :B~ Contribuire al progetto

source: 1~contributing-to-project Contributing to the project
it: 1~contributing-to-project Contribuire al progetto

source: Contributions to the project, such as translations and patches, are greatly welcome. Anyone can directly commit to the repositories, however, we ask you to send bigger changes to the mailing list to discuss them first. See the section {Contact}#contact for more information.
it: I contributi al progetto, come traduzioni e patch, sono estremamente benvenuti. Chiunque può eseguire il commit direttamente sul repository; tuttavia chiediamo di inviare le modifiche più corpose in mailing list, per poterne prima discutere. Per maggiori informazioni vedere la sezione {Contatti}#contact.

source: However, there are certain restrictions. The server will reject:
it: Tuttavia ci sono alcune restrizioni. Il server rifiuta:

source: _* Non fast-forward pushes.
it: _* push non fast-forward,

source: _* Merge commits.
it: _* commit merge,

source: _* Adding or removing tags or branches.
it: _* aggiunta o rimozione di tag e branch.

source: Even though all commits might be revised, we ask you to use your common sense and make good commits with good commit messages.
it: Anche se tutti i commit possono essere corretti, chiediamo di usare il buon senso ed eseguire buoni commit con dei buoni messaggi.

source: _* Write commit messages that consist of complete, meaningful sentences in English, starting with a capital letter and ending with a full stop. Usually, these will start with the form "Fixing/Adding/Removing/Correcting/Translating/...".
it: _* Si scrivano messaggi costituiti da frasi in inglese esaurienti e utili, inizianti con una lettera maiuscola e terminanti con un punto. Solitamente cominceranno con la forma "Fixing/Adding/Removing/Correcting/Translating/...".

source: _* Write good commit messages. The first line must be an accurate summary of the contents of the commit which will be included in the changelog. If you need to make some further explanations, write them below leaving a blank line after the first one and then another blank line after each paragraph. Lines of paragraphs should not exceed 80 characters in length.
it: _* Scrivere buoni messaggi nei commmit. La prima riga deve contenere un sunto accurato del contenuto del commit in quanto verrà incluso nel changelog. Se si necessita di aggiungere ulteriori spiegazioni, scriverle sotto lasciando una riga vuota dopo la prima e quindi un'altra vuota dopo ogni paragrafo. Le righe non devono superare gli 80 caratteri.

source: _* Commit atomically, this is to say, do not mix unrelated things in the same commit. Make one different commit for each change you make.
it: _* Eseguire commit atomici, ovvero non mescolare cose non inerenti tra loro nello stesso commit ma farne uno per ogni modifica apportata.

source: 2~ Making changes
it: 2~ Applicare le modifiche

source: In order to push to the repositories, you must follow the following procedure. Here we use live-manual as an example so replace it with the name of the repository you want to work with. For detailed information on how to edit live-manual see {Contributing to this document}#how-to-contribute.
it: Per eseguire il push ai repository è necessario seguire la seguente procedura. Verrà usato live-manual come esempio per cui rimpiazzalo con il nome del repository su cui si vuole lavorare. Per informazioni dettagliare su come modificare live-manual si veda {Contribuire a questo documento}#how-to-contribute.

source: _* Fetch the public commit key:
it: _* Prelevare la chiave pubblica:

source: _* Add the following section to your openssh-client config:
it: _* Aggiungere la seguente sezione alla propria configurazione di openssh-client:

source: _* Check out a clone of live-manual through ssh:
it: _* Scaricare tramite ssh un clone del manuale:

source: _* Make sure you have Git author and email set:
it: _* Assicurarsi di avere impostato autore e indirizzo email:

source: *{Important:}* Remember that you should commit any changes on the *{debian-next}* branch.
it: *{Importante:}* Notare che tutte le modifiche vanno eseguite sul ramo *{debian-next}*.

source: _* Make your changes. In this example you would first write a new section dealing with applying patches and then prepare to commit adding the files and writing your commit message like this:
it: _* Apportare le modifiche. In questo esempio si scrive prima una nuova sezione che si occupa di applicare patch e quindi prepararla al commit aggiungendo i file e scrivendo il messaggio in questo modo:

source: _* Push the commit to the server:
it: _* Inviare il commit al server:
