Repository: sinfallas/live-manual
Catalog: manual/po/*/user_customization-overview.ssi.po
Languages: it

source: :B~ Customizing contents
it: B~ Personalizzazione dei contenuti

source: 1~customization-overview Customization overview
it: 1~customization-overview Panoramica sulla personalizzazione

source: 2~ Build time vs. boot time configuration
it: 2~ Configurazione in fase di compilazione e di avvio

source: Live system configuration options are divided into build-time options which are options that are applied at build time and boot-time options which are applied at boot time. Boot-time options are further divided into those occurring early in the boot, applied by the live-boot package, and those that happen later in the boot, applied by live-config. Any boot-time option may be modified by the user by specifying it at the boot prompt. The image may also be built with default boot parameters so users can normally just boot directly to the live system without specifying any options when all of the defaults are suitable. In particular, the argument to #{lb --bootappend-live}# consists of any default kernel command line options for the Live system, such as persistence, keyboard layouts, or timezone. See {Customizing locale and language}#customizing-locale-and-language, for example.
it: La configurazione del sistema live è divisa in opzioni applicate in fase di compilazione e al momento dell'avvio. Le opzioni di compilazione sono ulteriormente divise in quelle che si verificano prima dell'avvio, applicate dal pacchetto live-boot, e quelle dopo l'avvio, applicate da live-config. Qualsiasi opzione in fase di avvio può essere modificata dall'utente specificandola al prompt di avvio. L'immagine può inoltre essere costruita con i parametri di avvio predefiniti in modo che quando tutti i valori predefiniti sono adatti gli utenti possano avviare direttamente il sistema senza specificare alcuna opzione. In particolare, l'argomento di #{lb --bootappend-live}# è costituito da tutte le opzioni da riga di comando del kernel predefinite in un sistema live, come persistenza dei dati, layout di tastiera o fuso orario. Per gli esempi si veda {Personalizzare localizzazione e lingua}#customizing-locale-and-language.

source: 2~stages-of-the-build Stages of the build
it: 2~stages-of-the-build Fasi della creazione

source: The build process is divided into stages, with various customizations applied in sequence in each. The first stage to run is the *{bootstrap}* stage. This is the initial phase of populating the chroot directory with packages to make a barebones Debian system. This is followed by the *{chroot}* stage, which completes the construction of chroot directory, populating it with all of the packages listed in the configuration, along with any other materials. Most customization of content occurs in this stage. The final stage of preparing the live image is the *{binary}* stage, which builds a bootable image, using the contents of the chroot directory to construct the root filesystem for the Live system, and including the installer and any other additional material on the target medium outside of the Live system's filesystem. After the live image is built, if enabled, the source tarball is built in the *{source}* stage.
it: Il processo di creazione è diviso in due fasi, con varie personalizzazioni applicate in sequenza a ciascuna di esse. La prima consiste nell'*{avvio}*, questa è la fase iniziale di popolamento della directory di chroot con i pacchetti atti a creare un sistema Debian di base. Viene quindi seguita dalla fase *{chroot}* che completa la costruzione della directory chroot e la popola con tutti i pacchetti elencati nella configurazione insieme a qualsiasi altro materiale; la maggior parte della personalizzazione dei contenuti avviene in questa tappa. La parte finale della preparazione dell'immagine è la fase *{binaria}* che genera un'immagine avviabile utilizzando i contenuti della directory chroot per costruire il file system pricipale per il sistema live, includere l'installatore e ogni altro materiale aggiuntivo sul supporto di destinazione al di fuori del file system del sistema live. Una volta che l'immagine è pronta viene creato, se abilitato, l'archivio dei sorgenti nella fase *{sorgenti}*.

source: Within each of these stages, there is a particular sequence in which commands are applied. These are arranged in such a way as to ensure customizations can be layered in a reasonable fashion. For example, within the *{chroot}* stage, preseeds are applied before any packages are installed, packages are installed before any locally included files are copied, and hooks are run later, after all of the materials are in place.
it: All'interno di ciascuna di queste fasi c'è una sequenza particolare in cui vengono applicati i comandi, sono organizzati in modo da assicurare che le personalizzazioni siano ragionevolmente stratificate. Ad esempio, nella fase *{chroot}* i preseed vengono applicati prima che qualsiasi pacchetto sia installato, i pacchetti vengono installati prima che qualsiasi file incluso localmente venga copiato e gli hook eseguiti dopo che tutto il materiale è a posto.

source: 2~ Supplement lb config with files
it: 2~ Integrare la configurazione di lb con dei file

source: 2~ Customization tasks
it: 2~ Personalizzazione dei compiti

source: The following chapters are organized by the kinds of customization task users typically perform: {Customizing package installation}#customizing-package-installation, {Customizing contents}#customizing-contents and {Customizing locale and language}#customizing-locale-and-language cover just a few of the things you might want to do.
it: I capitoli seguenti sono costituiti dai tipi di compito personalizzato che gli utenti eseguono solitamente: {personalizzare l'installazione dei pacchetti}#customizing-package-installation, {personalizzare i contenuti}#customizing-contents e {personalizzare localizzazione e lingua}#customizing-locale-and-language coprono solo alcune delle cose che si potrebbero desiderare.
