Repository: sinfallas/live-manual
Catalog: manual/po/*/user_basics.ssi.po
Languages: ca

source: :B~ The basics
ca: :B~ Conceptes bàsics

source: 1~the-basics The basics
ca: 1~the-basics Conceptes bàsics

source: This chapter contains a brief overview of the build process and instructions for using the three most commonly used image types. The most versatile image type, #{iso-hybrid}#, may be used on a virtual machine, optical medium or USB portable storage device. In certain special cases, as explained later, the #{hdd}# type may be more suitable. The chapter includes detailed instructions for building and using a #{netboot}# type image, which is a bit more involved due to the setup required on the server. This is an slightly advanced topic for anyone who is not already familiar with netbooting, but it is included here because once the setup is done, it is a very convenient way to test and deploy images for booting on the local network without the hassle of dealing with image media.
ca: Aquest capítol conté una breu descripció del procés de construcció i les instruccions per a l'utilització dels tres tipus d'imatge més comunes. El tipus d'imatge més versàtil #{iso-hybrid}# es pot utilitzar en una màquina virtual, en un medi òptic o qualsevol altre dispositiu d'emmagatzematge USB. En certs casos especials, com s'explica més endavant, el tipus #{hdd}# pot ser el més adequat. El capítol conté instruccions detallades per a la construcció d'una imatge tipus #{netboot}#, que és una mica més complicat a causa de la configuració necessària en el servidor. Aquest és un tema una mica avançat per a algú que no està familiaritzat ja amb l'arrencada en xarxa, però s'inclou aquí perquè un cop que la configuració es porta a terme, es tracta d'una manera molt convenient per a provar i desplegar imatges per a l'arrencada en xarxa local sense la molèstia de tractar amb els dispositius de les imatges.

source: The section finishes with a quick introduction to {webbooting}#webbooting which is, perhaps, the easiest way of using different images for different purposes, switching from one to the other as needed using the internet as a means.
ca: La secció acaba amb una breu introducció al {webbooting}#webbooting que és, potser, la forma més fàcil d'utilitzar imatges diferents per a diferents propòsits, canviant d'una a l'altra segons sigui necessari, utilitzant internet com un mitjà.

source: Throughout the chapter, we will often refer to the default filenames produced by live-build. If you are {downloading a prebuilt image}#downloading-prebuilt-images instead, the actual filenames may vary.
ca: Al llarg del capítol, sovint es fa referència als noms dels fitxers produïts per defecte per live-build. Si es {descarrega una imatge prefabricada}#downloading-prebuilt-images, els noms dels fitxers poden ser direrents.

source: 2~what-is-live What is a live system?
ca: 2~what-is-live Què és un sistema viu?

source: A live system usually means an operating system booted on a computer from a removable medium, such as a CD-ROM or USB stick, or from a network, ready to use without any installation on the usual drive(s), with auto-configuration done at run time (see {Terms}#terms).
ca: Un sistema viu és un sistema operatiu que arrenca en un equip des d'un dispositiu extraïble, com un CD-ROM o una memòria USB o des d'una xarxa, a punt per a fer servir sense cap tipus d'instal·lació en la unitat(s) habitual(s), amb una configuració automàtica feta en temps d'execució (veure {Termes}#terms).

source: With live systems, it's an operating system, built for one of the supported architectures (currently amd64 and i386). It is made from the following parts:
ca: Amb live systems, és un sistema operatiu, construït per a una de les arquitectures suportades (actualment amd64 i i386). Conté les següents parts:

source: _* *{Linux kernel image}*, usually named #{vmlinuz*}#
ca: _* *{Imatge del nucli Linux}*, generalment s'anomena #{vmlinuz*}#

source: _* *{Initial RAM disk image (initrd)}*: a RAM disk set up for the Linux boot, containing modules possibly needed to mount the System image and some scripts to do it.
ca: _* *{Imatge del disc RAM inicial (initrd)}*: un disc RAM configurat per a l'arrencada de Linux, que conté els mòduls que possiblement es necessitaran per a muntar la imatge del sistema i algunes seqüències d'ordres per a fer-ho.

source: _* *{System image}*: The operating system's filesystem image. Usually, a SquashFS compressed filesystem is used to minimize the live system image size. Note that it is read-only. So, during boot the live system will use a RAM disk and 'union' mechanism to enable writing files within the running system. However, all modifications will be lost upon shutdown unless optional persistence is used (see {Persistence}#persistence).
ca: _* *{Imatge del sistema}*: Imatge del sistema de fitxers del sistema operatiu. Normalment, s'utilitza un sistema de fitxers comprimit SquashFS per a minimitzar la mida de la imatge. Tenir en compte que és de només lectura. Així, durant l'arrencada, el sistema Debian Live utilitzarà el disc RAM i un mecanisme de "unió" per a permetre l'escriptura de fitxers en el sistema en funcionament. No obstant això, totes les modificacions es perdran al apagar l'equip si no és que s'utilitza la persistència opcional (vegeu {Persistència}#persistence).

source: _* *{Bootloader}*: A small piece of code crafted to boot from the chosen medium, possibly presenting a prompt or menu to allow selection of options/configuration. It loads the Linux kernel and its initrd to run with an associated system filesystem. Different solutions can be used, depending on the target medium and format of the filesystem containing the previously mentioned components: isolinux to boot from a CD or DVD in ISO9660 format, syslinux for HDD or USB drive booting from a VFAT partition, extlinux for ext2/3/4 and btrfs partitions, pxelinux for PXE netboot, GRUB for ext2/3/4 partitions, etc.
ca: _* *{Carregador d'arrencada }*: Una petita peça de codi dissenyat per a arrencar des del medi triat, possiblement presentant un indicador d'arrencada o un menú per a permetre la selecció d'opcions/configuració. Carrega el nucli de Linux i el seu initrd per a funcionar amb un sistema de fitxers del sistema associat. Es poden utilitzar diverses solucions, en funció del medi de destinació i el format del sistema de fitxers que conté els components esmentats anteriorment: isolinux per a arrencar des de CD o DVD en format ISO9660, syslinux per a una unitat USB o HDD que s'iniciarà des de particions VFAT, extlinux per a particions ext2/3/4 i btrfs, pxelinux per a PXE netboot, GRUB per a particions ext2/3/4, etc.

source: You can use live-build to build the system image from your specifications, set up a Linux kernel, its initrd, and a bootloader to run them, all in one medium-dependant format (ISO9660 image, disk image, etc.).
ca: Es pot utilitzar live-build per a construir la imatge del sistema amb especificacions pròpies, configurar un nucli de Linux, el initrd, i un carregador d'arrencada per a executar-los, tot això en un format depenent del medi (imatge ISO9660, imatge de disc, etc.).

source: 2~downloading-prebuilt-images Downloading prebuilt images
ca: 2~downloading-prebuilt-images Descàrrega d'imatges prefabricades

source: While the focus of this manual is developing and building your own live images, you may simply wish to try one of our prebuilt images, either as an introduction to their use or instead of building your own. These images are built using our {live-images git repository}#clone-configuration-via-git and official stable releases are published at https://www.debian.org/CD/live/. In addition, older and upcoming releases, and unofficial images containing non-free firmware and drivers are available at http://live-systems.org/cdimage/release/.
ca: Si bé l'objectiu d'aquest manual és el desenvolupament i la construcció d'imatges en viu pròpies, es pot simplement voler provar una de les nostres imatges prefabricades, ja sigui com una introducció al seu ús o a la construcció d'imatges personalitzades. Aquestes imatges estan construïdes utilitzant el nostre {repositori git live-images}#clone-configuration-via-git i les versions oficials estables es publiquen a https://www.debian.org/CD/live/. A més, les versions antigues i les futures, i les imatges no oficials que contenen microprogramari i controladors no lliures estan disponibles a http://live-systems.org/cdimage/release/.

source: 2~using-web-builder Using the web live image builder
ca: 2~using-web-builder Ús del servei de construcció d'imatges en viu web

source: As a service to the community, we run a web-based live image builder service at http://live-systems.org/build/. This site is maintained on a best effort basis. That is, although we strive to keep it up-to-date and operational at all times, and do issue notices for significant operational outages, we cannot guarantee 100% availability or fast image building, and the service may occasionally have issues that take some time to resolve. If you have problems or questions about the service, please {contact us}#contact, providing us with the link to your build.
ca: Com un servei a la comunitat, oferim un servei web capaç de construïr imatges en viu a http://live-systems.org/build/. Aquest lloc es mantingut sobre una base del millor esforç. És a dir, encara que ens esforcem per a mantenir-lo al dia i que estigui operatiu en tot moment, i de fer anuncis d'interrupcions importants del servei, no podem garantir una disponibilitat del 100% o una creació d'imatges ràpida. Tanmateix, el servei pot tenir, de tant en tant, problemes que triguin algun temps en resoldre's. Si es té problemes o preguntes sobre aquest servei, posar-se en {contacte amb nosaltres}#contact, proporcionant l'enllaç a la pàgina web de la imatge construïda.

source: 3~ Web builder usage and caveats
ca: 3~ Ús i advertències sobre el servei web

source: The web interface currently makes no provision to prevent the use of invalid combinations of options, and in particular, where changing an option would normally (i.e. using live-build directly) change defaults of other options listed in the web form, the web builder does not change these defaults. Most notably, if you change #{--architectures}# from the default #{i386}# to #{amd64}#, you must change the corresponding option #{--linux-flavours}# from the default #{586}# to #{amd64}#. See the #{lb_config}# man page for the version of live-build installed on the web builder for more details. The version number of live-build is listed at the bottom of the web builder page.
ca: La interfície web actualment no pot prevenir l'ús de combinacions d'opcions no vàlides, i en particular, quan el canvi d'una opció que normalment (és a dir, utilitzant live-build directament) canviaria els valors predeterminats d'altres opcions que figuren en el formulari de la web, el constructor web no canvia aquests valors predeterminats. En particular, si es canvia #{--architectures}# del valor per defecte #{i386}# a #{amd64}#, s'ha de canviar l'opció corresponent #{--linux-flavours}# del valor per defecte #{586}# a #{amd64}#. Veure la pàgina del manual #{lb_config}# per a la versió de live-build instal·lada al constructor web per a més detalls. El nombre de la versió de live-build apareix a la part inferior de la pàgina web.

source: The time estimate given by the web builder is a crude estimate only and may not reflect how long your build actually takes. Nor is the estimate updated once it is displayed. Please be patient. Do not refresh the page you land on after submitting the build, as this will resubmit a new build with the same parameters. You should {contact us}#contact if you don't receive notification of your build only once you are certain you've waited long enough and verified the notification e-mail did not get caught by your own e-mail spam filter.
ca: El càlcul de temps donat pel constructor web és només una estimació aproximada i pot no reflectir acuradament el temps que realment es necessita per a finalitzar la construcció d'una imatge. Tenir en compte que aquesta estimació tampoc s'actualitza tal i com va passant el temps. Cal tenir una mica de paciència. No tornar a carregar la pàgina després de enviar la proposta de construcció, ja que això pot tornar a reenviar una nova petició amb els mateixos paràmetres. Posar-se {en contacte amb nosaltres}#contact si no es rep la notificació de la construcció un cop que s'estigui segur que s'ha esperat prou i verificat que la notificació per correu electrònic no ha anat a parar al spam.

source: The web builder is limited in the kinds of images it can build. This keeps it simple and efficient to use and maintain. If you would like to make customizations that are not provided for by the web interface, the rest of this manual explains how to build your own images using live-build.
ca: El servei web està limitat en el tipus d'imatges que es poden construir. Això el manté simple i eficient d'utilitzar i mantenir. Si es desitja realitzar personalitzacions que no es contemplen en la interfície web, a la resta d'aquest manual s'explica com crear imatges pròpies amb live-build.

source: 2~building-iso-hybrid First steps: building an ISO hybrid image
ca: 2~building-iso-hybrid Primers passos: construcció d'una imatge ISO híbrida

source: Regardless of the image type, you will need to perform the same basic steps to build an image each time. As a first example, create a build directory, change to that directory and then execute the following sequence of live-build commands to create a basic ISO hybrid image containing a default live system without X.org. It is suitable for burning to CD or DVD media, and also to copy onto a USB stick.
ca: Independentment del tipus d'imatge, s'haurà de fer els mateixos passos bàsics per a construir una imatge cada vegada. Com a primer exemple, crear un directori de treball, canviar a aquest directori i executar la següent seqüència d'ordres live-build per a crear una imatge ISO híbrida de base que conté només el sistema per defecte de Debian sense X.org. És adequat per a gravar en un CD o DVD, i també per a copiar en una memòria USB.

source: The name of the working directory is absolutely up to you, but if you take a look at the examples used throughout live-manual, it is a good idea to use a name that helps you identify the image you are working with in each directory, especially if you are working or experimenting with different image types. In this case you are going to build a default system so let's call it, for example, live-default.
ca: El nom del directori de treball és absolutament indiferent, però si es fa un cop d'ull als exemples utilitzats a live-manual, és una bona idea utilitzar un nom que ajudi a identificar la imatge amb que s'està treballant en cada directori, especialment si s'està treballant o experimentant amb diferents tipus d'imatges. En aquest cas, anem a construir un sistema per defecte així que l'anomenarem, per exemple, live-default.

source: Then, run the #{lb config}# command. This will create a "config/" hierarchy in the current directory for use by other commands:
ca: Aleshores, executar l'ordre #{lb config}#. Això crearà una jerarquia «config/» en el directori actual per a ser utilitzada per altres ordres:

source: No parameters are passed to these commands, so defaults for all of their various options will be used. See {The lb config command}#lb-config for more details.
ca: Aquí no es passa cap paràmetre a aquestes ordres, per tant s'utilitzaran les opcions per defecte. Veure {L'ordre lb config}#lb-config per a més detalls.

source: Now that the "config/" hierarchy exists, build the image with the #{lb build}# command:
ca: Ara que la jerarquia «config/» ja existeix, crear la imatge amb l'ordre #{lb build}#:

source: This process can take a while, depending on the speed of your computer and your network connection. When it is complete, there should be a #{live-image-i386.hybrid.iso}# image file, ready to use, in the current directory.
ca: Aquest procés tardarà una mica, depenent de la velocitat del ordinador i de la connexió de la xarxa. Quan hagi acabat, ha d'haver un fitxer imatge #{live-image-i386.hybrid.iso}#, a punt per a ser utilitzat, en el directori actual.

source: *{Note:}* If you are building on an amd64 system the name of the resulting image will be #{live-image-amd64.hybrid.iso}#. Keep in mind this naming convention throughout the manual.
ca: *{Nota:}* Si s'està construint en un sistema amd64 el nom de la imatge resultant serà #{live-image-amd64.hybrid.iso}#. Tenir en compte aquesta convenció al llarg del manual.

source: 2~using-iso-hybrid Using an ISO hybrid live image
ca: 2~using-iso-hybrid Usar una imatge ISO híbrida en viu

source: After either building or downloading an ISO hybrid image, which can be obtained at https://www.debian.org/CD/live/, the usual next step is to prepare your medium for booting, either CD-R(W) or DVD-R(W) optical media or a USB stick.
ca: Després de la construcció o la descàrrega d'una imatge ISO híbrida, que pot ser obtinguda a https://www.debian.org/CD/live/, el següent pas habitual és preparar el dispositiu per a l'arrencada, ja sigui medis òptics com un CD-R(W) o DVD-R(W) o una memòria USB.

source: 3~burning-iso-image Burning an ISO image to a physical medium
ca: 3~burning-iso-image Gravar una imatge ISO en un medi físic

source: Burning an ISO image is easy. Just install /{xorriso}/ and use it from the command-line to burn the image. For instance:
ca: Gravar una imatge ISO és fàcil. Simplement cal instal·lar /{xorriso}/ i utilitzar-lo des de la línia d'ordres per a gravar la imatge. Per exemple:

source: 3~copying-iso-hybrid-to-usb Copying an ISO hybrid image to a USB stick
ca: 3~copying-iso-hybrid-to-usb Copiar una imatge ISO híbrida en un dispositiu USB

source: ISO images prepared with #{xorriso}#, can be simply copied to a USB stick with the #{cp}# program or an equivalent. Plug in a USB stick with a size large enough for your image file and determine which device it is, which we hereafter refer to as #{${USBSTICK}}#. This is the device file of your key, such as #{/dev/sdb}#, not a partition, such as #{/dev/sdb1}#! You can find the right device name by looking in #{dmesg}#'s output after plugging in the stick, or better yet, #{ls -l /dev/disk/by-id}#.
ca: Les imatges ISO preparades amb #{xorriso}#, és poden copiar directament a una memòria USB utilitzant el programa #{cp}# o un altre d'equivalent. Connectar una memòria USB amb una mida prou gran per al fitxer de la imatge i determinar quin dispositiu és, que d'ara endavant anomenarem #{${USBSTICK}}#. Aquest és el dispositiu de la memòria, com per exemple #{/dev/sdb}#, i no una partició, com ara #{/dev/sdb1}#! Es pot trobar el nom del dispositiu correcte mirant la sortida de #{dmesg}# després de connectar la memòria usb, o encara millor, #{ls -l /dev/disk/by-id}#.

source: Once you are certain you have the correct device name, use the #{cp}# command to copy the image to the stick. *{This will definitely overwrite any previous contents on your stick!}*
ca: Quan s'estigui segur de tenir el nom del dispositiu correcte, utilitzar l'ordre #{cp}# per a copiar la imatge a la memòria. *{Fent això es perdran definitivament tots els continguts anteriors de la memòria usb!}*

source: *{Note:}* The /{sync}/ command is useful to ensure that all the data, which is stored in memory by the kernel while copying the image, is written to the USB stick.
ca: *{Nota:}* L'ordre /{sync}/ s'utilitza per a assegurar-se que totes les dades, que el nucli emmagatzema en la memòria durant la còpia de la imatge, s'escriuen en el dispositiu USB.

source: 3~using-usb-extra-space Using the space left on a USB stick
ca: 3~using-usb-extra-space Utilitzar l'espai lliure en una memòria USB

source: After copying the #{live-image-i386.hybrid.iso}# to a USB stick, the first partition on the device will be filled up by the live system. To use the remaining free space, use a partitioning tool such as /{gparted}/ or /{parted}/ to create a new partition on the stick.
ca: Després de copiar la #{live-image-i386.hybrid.iso}# en un dispositiu USB, la primera partició serà utilitzada pel sistema en viu. Per a poder utilitzar l'espai que queda lliure es pot utilitzar una eina de particionament com /{gparted}/ o /{parted}/ per a crear una nova partició.

source: After the partition is created, where #{${PARTITION}}# is the name of the partition, such as #{/dev/sdb2}#, you have to create a filesystem on it. One possible choice would be ext4.
ca: Després de crear la partició, on #{${PARTITION}}# és el nom de la partició, com ara #{/dev/sdb2}#, s'ha de crear un sistema de fitxers. Una opció possible seria ext4.

source: *{Note:}* If you want to use the extra space with Windows, apparently that OS cannot normally access any partitions but the first. Some solutions to this problem have been discussed on our {mailing list}#contact, but it seems there are no easy answers.
ca: *{Nota:}* Si es vol utilitzar l'espai addicional amb Windows, pel que sembla, aquest sistema operatiu normalment no pot accedir a altres particions més que a la primera. Algunes solucions a aquest problema han estat discutides a la nostra {llista de correu}#contact, però sembla que no hi ha respostes fàcils.

source: *{Remember: Every time you install a new live-image-i386.hybrid.iso on the stick, all data on the stick will be lost because the partition table is overwritten by the contents of the image, so back up your extra partition first to restore again after updating the live image.}*
ca: *{Recordar: Cada vegada que s'instal·li una nova live-image-i386.hybrid.iso al dispositiu, es perdran totes les dades perquè la taula de particions se sobreescriu amb el contingut de la imatge, de manera que es assenyat fer una còpia de seguretat de la partició addicional per a restaurar les dades de nou després d'actualitzar la imatge en viu.}*

source: 3~booting-live-medium Booting the live medium
ca: 3~booting-live-medium Arrencar el medi en viu

source: The first time you boot your live medium, whether CD, DVD, USB key, or PXE boot, some setup in your computer's BIOS may be needed first. Since BIOSes vary greatly in features and key bindings, we cannot get into the topic in depth here. Some BIOSes provide a key to bring up a menu of boot devices at boot time, which is the easiest way if it is available on your system. Otherwise, you need to enter the BIOS configuration menu and change the boot order to place the boot device for the live system before your normal boot device.
ca: La primera vegada que s'arrenqui el medi en viu, ja sigui des de CD, DVD, memòria USB, o PXE, pot ser necessaria alguna petita configuració al BIOS del ordinador en primer lloc. Atès que les BIOS varien molt en les seves funcions i dreceres de teclat, no podem entrar en el tema en profunditat aquí. Algunes BIOS proporcionen una tecla per a obrir un menú de dispositius d'arrencada, que és la manera més fàcil si es troba disponible al sistema. En cas contrari, cal entrar al menú de configuració del BIOS i canviar l'ordre d'arrencada per a situar el dispositiu del sistema en viu abans que el dispositiu d'arrencada normal.
