Repository: sinfallas/live-manual
Catalog: manual/po/*/user_managing_a_configuration.ssi.po
Languages: ca, it

source: :B~ Managing a configuration
ca: :B~ Gestió d'una configuració
it: :B~ Gestire una configurazione

source: 1~managing-a-configuration Managing a configuration
ca: 1~managing-a-configuration Gestió d'una configuració
it: 1~managing-a-configuration Gestire una configurazione

source: This chapter explains how to manage a live configuration from initial creation, through successive revisions and successive releases of both the live-build software and the live image itself.
ca: En aquest capítol s'explica com gestionar una configuració d'un sistema en viu des de la seva creació inicial, a través de revisions i versions successives de tant el programari live-build com de la imatge en viu en si mateixa.
it: Questo capitolo spiega come gestire una configurazione per una live sin dalla creazione iniziale, attraverso le successive revisioni e rilasci sia del software live-build che della stessa immagine.

source: 2~ Dealing with configuration changes
ca: 2~ Gestionar canvis en la configuració
it: 2~ Gestire i cambiamenti di configurazione

source: Live configurations rarely are perfect on the first try. It may be fine to pass #{lb config}# options from the command-line to perform a single build, but it is more typical to revise those options and build again until you are satisfied. To support these changes, you will need auto scripts which ensure your configuration is kept in a consistent state.
ca: Les configuracions de sistemes en viu poques vegades són perfectes al primer intent. Passar opcions a #{lb config}# des de la línea d'ordres pot estar be per a construir una imatge una vegada, però és més típic revisar aquestes opcions i construir de nou fins que se'n estigui satisfet. Per a donar suport a aquests canvis, es poden utilitzar scripts auto que assegurin que la configuració es manté en un estat consistent.
it: Le configurazioni live sono di rado perfette al primo tentativo. Può andar bene passare le opzioni di #{lb config}# a riga di comando per eseguire una compilazione ma è tipico rivedere queste opzioni e compilare finché non si è soddisfatti. Per gestire le modifiche c'è bisogno di script automatici che assicurano che la propria configurazione sia coerente.

source: 3~ Why use auto scripts? What do they do?
ca: 3~ Per què utilitzar scripts auto? Què fan?
it: 3~ Perché utilizzare gli script automatici? Cosa fanno?

source: The #{lb config}# command stores the options you pass to it in #{config/*}# files along with many other options set to default values. If you run #{lb config}# again, it will not reset any option that was defaulted based on your initial options. So, for example, if you run #{lb config}# again with a new value for #{--binary-images}#, any dependent options that were defaulted for the old image type may no longer work with the new ones. Nor are these files intended to be read or edited. They store values for over a hundred options, so nobody, let alone yourself, will be able to see in these which options you actually specified. And finally, if you run #{lb config}#, then upgrade live-build and it happens to rename an option, #{config/*}# would still contain variables named after the old option that are no longer valid.
ca: L'ordre #{lb config}# emmagatzema les opcions que se li passen als fitxers de #{config/*}#, juntament amb moltes altres opcions que estan establertes als valors per defecte. Si s'executa un cop més, #{lb config}# no es restablirà cap de les opcios dependents basades en les opcions inicials. Així, per exemple, si s'executa de nou #{lb config}# amb un nou valor per a #{--binary-images}#, totes les opcions que en depenen que es van omplir per al tipus de imatge per defecte ja no poden funcionar amb la nova. Aquests fitxers no estan destinats a ser llegits o editats. S'emmagatzemen els valors de més de cent opcions, i ningú pot veure les opcions que s'han especificat realment. I finalment, si s'executa #{lb config}# i a continuació s'actualitza live-build i el nom d'una opció canvia, #{config/*}# encara contindrà les variables de l'opció vella que ja no són vàlides.

source: For all these reasons, #{auto/*}# scripts will make your life easier. They are simple wrappers to the #{lb config}#, #{lb build}# and #{lb clean}# commands that are designed to help you manage your configuration. The #{auto/config}# script stores your #{lb config}# command with all desired options, the #{auto/clean}# script removes the files containing configuration variable values, and the #{auto/build}# script keeps a #{build.log}# of each build. Each of these scripts is run automatically every time you run the corresponding #{lb}# command. By using these scripts, your configuration is easier to read and is kept internally consistent from one revision to the next. Also, it will be much easier for you identify and fix options which need to change when you upgrade live-build after reading the updated documentation.
ca: Per totes aquestes raons, els scripts #{auto/*}# ens fan la vida més fàcil. Són simples embolcalls per les ordres #{lb config}#, #{lb build}# i #{lb clean}# dissenyats per ajudar a gestionar una configuració. Només cal crear un script #{auto/config}# que contingui totes les opcions que es desitgin per a #{lb config}#, i un #{auto/clean}# que elimini els fitxers que continguin diversos valors de variables de configuració, i el script #{auto/build}# guarda un #{build.log}# de cada construcció. Cada vegada que s'executi l'ordre #{lb}# corresponent, aquests fitxers seran executats automàticament. L'ús d'aquests scripts assegurarà que la configuració sigui més senzilla de llegir i que guardi una coherència interna d'una reversió a una altra. A més a més serà més fàcil identificar i solucionar les opcions que s'han de canviar al actualitzar d'una versió de live-build a la següent després de llegir la documentació.
it: Per queste ragioni gli script nella directory #{auto/*}# faciliteranno il lavoro; sono semplici wrapper ai comandi #{lb config}#, #{lb build}# e #{lb clean}# designati per aiutare a gestire la configurazione. Gli script in #{auto/config}# memorizzano i comandi di #{lb config}# con le opzioni desiderate, quelli in #{auto/clean}# rimuovono i file contenenti i valori delle variabili di configurazione, mentre gli script in #{auto/build}# tengono un #{build.log}# di ogni compilazione. Ognuno di questi script viene eseguito automaticamente ogni qualvolta si esegue il comando #{lb}# corrispondente; utilizzandoli la vostra configurazione sarà più semplice da leggere e verrà mantenuta coerente da una revisione all'altra. Inoltre sarà molto più facile identificare e sistemare le opzioni che necessitano di modifiche quando si aggiorna live-build dopo aver letto la documentazione aggiornata.

source: 3~ Use example auto scripts
ca: 3~ Utilitzar scripts auto d'exemple
it: 3~ Esempi d'uso di script automatici

source: For your convenience, live-build comes with example auto shell scripts to copy and edit. Start a new, default configuration, then copy the examples into it:
ca: Per a més comoditat, live-build ve amb uns scripts d'exemple per a copiar i editar. Iniciar una nova configuració per defecte, i a continuació, copiar els exemples:
it: Per comodità live-build è fornito di esempi di script automatici da copiare e modificare. Inizializzare una nuova configurazione predefinita quindi copiare gli esempi in essa:

source: Edit #{auto/config}#, adding any options as you see fit. For instance:
ca: Editar #{auto/config}#, afegint les opcions més adients. Per exemple:
it: Modificare #{auto/config}# aggiungendo qualsiasi opzione vi serva, esempio:

source: Now, each time you use #{lb config}#, #{auto/config}# will reset the configuration based on these options. When you want to make changes to them, edit the options in this file instead of passing them to #{lb config}#. When you use #{lb clean}#, #{auto/clean}# will clean up the #{config/*}# files along with any other build products. And finally, when you use #{lb build}#, a log of the build will be written by #{auto/build}# in #{build.log}#.
ca: Ara, cada vegada que s'utilitzi #{lb config}#, #{auto/config}# restablirà la configuració basada en aquestes opcions. Quan es vulgui fer canvis, editar les opcions d'aquest fitxer en lloc de passar-les a #{lb config}#. Quan s'utilitza #{lb clean}#, #{auto/clean}# netejarà els fitxers de #{config/*}# juntament amb els altres productes de construcció. I, finalment, quan s'utilitza #{lb build}#, es crea un log de la construcció mitjançant #{auto/build}# anomenat #{build.log}#.
it: Ogni volta che verrà usato #{lb config}#, #{auto/config}# ripristinerà la configurazione in base a queste opzioni; quando si vogliono apportare modifiche basterà modificare le opzioni in questo file invece di passarle a #{lb config}#. Utilizzando #{lb clean}#, #{auto/clean}# pulirà i file in #{config/*}# insieme a qualsiasi altro creato dalla compilazione. Infine, quando si usa #{lb build}#, verrà scritto da #{auto/build}# un file di log della compilazione in #{build.log}#.

source: *{Note:}* A special #{noauto}# parameter is used here to suppress another call to #{auto/config}#, thereby preventing infinite recursion. Make sure you don't accidentally remove it when making edits. Also, take care to ensure when you split the #{lb config}# command across multiple lines for readability, as shown in the example above, that you don't forget the backslash (\) at the end of each line that continues to the next.
ca: *{Nota:}* Aquí s'utilitza un paràmetre especial #{noauto}# per a suprimir un altra crida a #{auto/config}#, la qual cosa impedeix la recursivitat infinita. Assegurar-se de no eliminarlo accidentalment fent canvis. També, tenir cura de que quan es divideix l'ordre #{lb config}# a través de diverses línies per a facilitar la lectura, com es mostra en l'exemple anterior, no s'oblidi la barra invertida (\) al final de cada línia que segueix a la següent.
it: *{Nota:}* il parametro speciale #{noauto}# viene qui usato per impedire un'ulteriore chiamata di #{auto/config}#, impedendo quindi infinite chiamate ricorsive; assicurarsi di non rimuoverlo facendo modifiche. Quando si dividono comandi lunghi di #{lb config}# su più righe per agevolarne la leggibilità, non dimenticare il backslash (\) alla fine di ogni riga che continua sulla successiva, come mostrato poc'anzi nell'esempio di script.

source: 2~clone-configuration-via-git Clone a configuration published via Git
ca: 2~clone-configuration-via-git Clonar una configuració publicada via Git
it: 2~clone-configuration-via-git Clonare una configurazione pubblicata tramite Git.

source: Use the #{lb config --config}# option to clone a Git repository that contains a live system configuration. If you would like to base your configuration on one maintained by the ${project}, look at http://live-systems.org/gitweb/ for the repository named #{live-images}# in the category #{Packages}#. This repository contains the configurations for the live systems {prebuilt images}#downloading-prebuilt-images.
ca: Utilitzar l'opció #{lb config --config}# per a clonar un repositori Git que contingui una configuració en viu. Si es vol basar la configuració en un repositori mantingut pel ${project}, mirar el repositori a http://live-systems.org/gitweb/ amb el nom #{live-images}# sota el títol #{Packages}#. Aquest repositori conté les configuracions per a les {imatges prefabricades}#downloading-prebuilt-images

source: For example, to build a standard image, use the #{live-images}# repository as follows:
ca: Per exemple, per a construir una imatge standard, utilitzar el repositori #{live-images}# de la manera següent:

source: Edit #{auto/config}# and any other things you need in the #{config}# tree to suit your needs. For example, the unofficial non-free prebuilt images are made by simply adding #{--archive-areas "main contrib non-free"}#.
ca: Editar #{auto/config}# i qualsevol altra cosa necessària dins l'arbre #{config}# per a satisfer les necessitats pròpies. Per exemple, per a fer les imatges prefabricades no oficials que contenen paquets de la secció non-free simplement s'afegeix #{--archive-areas "main contrib non-free"}#.
it: Modificare #{auto/config}# e qualsiasi altro file presente in #{config}# necessario alle proprie esigenze. Ad esempio, le immagini non-free precompilate non ufficiali sono create semplicemente aggiungendo #{--archive-areas "main contrib non-free"}#.

source: You may optionally define a shortcut in your Git configuration by adding the following to your #{${HOME}/.gitconfig}#:
ca: Si es desitja, es pot definir una drecera en la configuració de Git, afegint el següent a #{${HOME}/.gitconfig}#:
it: È possibile definire una scorciatoia nella configurazione di Git aggiungendo quanto segue al file #{${HOME}/.gitconfig}#:

source: This enables you to use #{lso:}# anywhere you need to specify the address of a #{live-systems.org}# git repository. If you also drop the optional #{.git}# suffix, starting a new image using this configuration is as easy as:
ca: Això permet utilitzar #{lso:}# en qualsevol lloc on cal especificar la direcció d'un repositori git. També es pot omitir el sufix #{.git}#, i així, començar una nova imatge amb aquesta configuració és tan fàcil com:

source: Cloning the entire #{live-images}# repository pulls the configurations used for several images. If you feel like building a different image after you have finished with the first one, change to another directory and again and optionally, make any changes to suit your needs.
ca: Clonar tot el repositori #{live-images}# còpia les configuracions utilitzades per diverses imatges. Si es vol construir una imatge diferent després d'haver acabat amb la primera, canviar a un altre directori i un altre cop i, opcionalment, fer els canvis per a adaptar-les a les necessitats pròpies.
it: Clonando l'intero repository #{live-images}# si ottengono configurazioni usate per svariate immagini. Se dopo aver terminato la prima si vuole creare un'immagine differente, basterà cambiare directory e opzionalmente fare di nuovo le modifiche necessarie alle proprie esigenze.

source: In any case, remember that every time you will have to build the image as superuser: #{lb build}#
ca: En qualsevol cas, recordar que cada vegada que s'ha de construir una imatge, s'ha de fer com a superusuari: #{lb build}#
it: In ogni caso ricordarsi che ogni volta si dovrà creare l'immagine come utente root: #{lb build}#
