Repository: sinfallas/live-manual
Catalog: manual/po/*/user_basics.ssi.po
Languages: ca

source: Once you've booted the medium, you are presented with a boot menu. If you just press enter here, the system will boot using the default entry, #{Live}# and default options. For more information about boot options, see the "help" entry in the menu and also the live-boot and live-config man pages found within the live system.
ca: Després d'arrencar des del dispositiu, es veurà un menu d'inici. Si es prem «entrer» el sistema s'iniciarà amb l'entrada #{Live}# i les seves opcions per defecte. Per a obtenir més informació sobre les opcions d'arrencada, llegir «l'ajuda» (help) al menú i també les pàgines del manual de live-boot i live-config que es troben dins del sistema en viu.

source: Assuming you've selected #{Live}# and booted a default desktop live image, after the boot messages scroll by, you should be automatically logged into the #{user}# account and see a desktop, ready to use. If you have booted a console-only image, such as a #{standard}# flavour {prebuilt image}#downloading-prebuilt-images, you should be automatically logged in on the console to the #{user}# account and see a shell prompt, ready to use.
ca: Suposant que s'ha seleccionat #{Live}# i s'ha arrencat una imatge d'escriptori per defecte, després que els missatges d'arrencada hagin passat s'haurà iniciat una sessió com a usuari #{user}# i es veurà un escriptori, a punt per a ser utilitzat. Si s'ha arrencat una imatge de només consola, com per exemple una imatge #{standard}# de les {imatges prefabricades}#downloading-prebuilt-images, s'iniciarà una sessió com a usuari #{user}# i es veurà el indicador de la shell, a punt per a ser utilitzat.

source: 2~using-virtual-machine Using a virtual machine for testing
ca: 2~using-virtual-machine Utilitzar una màquina virtual per a fer proves

source: It can be a great time-saver for the development of live images to run them in a virtual machine (VM). This is not without its caveats:
ca: Pot ser un gran estalvi de temps per al desenvolupament d'imatges en viu executar-les en una màquina virtual (VM). Això no està exempt d'advertiments:

source: _* Running a VM requires enough RAM for both the guest OS and the host and a CPU with hardware support for virtualization is recommended.
ca: _* L'execució d'una màquina virtual requereix de suficient memòria RAM, tant per al sistema operatiu convidat i l'amfitrió i es recomana una CPU amb suport de maquinari per a la virtualització.

source: _* There are some inherent limitations to running on a VM, e.g. poor video performance, limited choice of emulated hardware.
ca: _* Hi ha algunes limitacions inherents a l'execució en una màquina virtual, per exemple, rendiment de vídeo pobre, opcions limitadades de maquinari emulat.

source: _* When developing for specific hardware, there is no substitute for running on the hardware itself.
ca: _* En el desenvolupament per a un maquinari específic, no hi ha cap substitut millor que el propi maquinari.

source: _* Occasionally there are bugs that relate only to running in a VM. When in doubt, test your image directly on the hardware.
ca: _* De tant en tant hi ha errors que només sorgeixen durant l'execució en una màquina virtual. En cas de dubte, comprovar la imatge directament al maquinari.

source: Provided you can work within these constraints, survey the available VM software and choose one that is suitable for your needs.
ca: Sempre que es pugui treballar dins d'aquestes limitacions, examinar el programari de màquina virtual disponible i triar un que sigui adequat per a les necessitats pròpies.

source: 3~testing-iso-with-qemu Testing an ISO image with QEMU
ca: 3~testing-iso-with-qemu Provar una imatge ISO amb QEMU

source: The most versatile VM in Debian is QEMU. If your processor has hardware support for virtualization, use the /{qemu-kvm}/ package; the /{qemu-kvm}/ package description briefly lists the requirements.
ca: La màquina virtual més versàtil dins Debian és QEMU. Si el processador té suport de maquinari per a la virtualització, utilitzar el paquet /{qemu-kvm}/; la descripció del paquet /{qemu-kvm}/ enumera breument els requisits.

source: First, install /{qemu-kvm}/ if your processor supports it. If not, install /{qemu}/, in which case the program name is #{qemu}# instead of #{kvm}# in the following examples. The /{qemu-utils}/ package is also valuable for creating virtual disk images with #{qemu-img}#.
ca: Primer, instal·lar /{qemu-kvm}/ si el processador ho suporta. Si no, instal·lar /{qemu}/, en aquest cas el nom del programa és #{qemu}# en lloc de #{kvm}# en els exemples següents. El paquet /{qemu-utils}/ també és valuós per a la creació d'imatges de disc virtuals amb #{qemu-img}#.

source: Booting an ISO image is simple:
ca: Arrencar una imatge ISO és senzill:

source: See the man pages for more details.
ca: Veure les pàgines del manual per a més detalls

source: 3~testing-iso-with-virtualbox Testing an ISO image with VirtualBox
ca: 3~testing-iso-with-virtualbox Provar una imatge ISO amb VirtualBox

source: In order to test the ISO with /{virtualbox}/:
ca: Per a provar la ISO amb /{virtualbox}/:

source: Create a new virtual machine, change the storage settings to use #{live-image-i386.hybrid.iso}# as the CD/DVD device, and start the machine.
ca: Crear una nova màquina virtual, canviar els paràmetres d'emmagatzematge per a utilitzar #{live-image-i386.hybrid.iso}# com unitat de CD/DVD i arrencar la màquina.

source: *{Note:}* For live systems containing X.org that you want to test with /{virtualbox}/, you may wish to include the VirtualBox X.org driver package, /{virtualbox-guest-dkms}/ and /{virtualbox-guest-x11}/, in your live-build configuration. Otherwise, the resolution is limited to 800x600.
ca: *{Nota:}* Per a provar sistemes vius que contenen X.org amb /{virtualbox}/, segurament es assenyat incloure el paquet del driver VirtualBox X.org, /{virtualbox-guest-dkms}/ i /{virtualbox-guest-x11}/, en la configuració de live-build. En cas contrari, la resolució es limita a 800x600.

source: In order to make the dkms package work, also the kernel headers for the kernel flavour used in your image need to be installed. Instead of manually listing the correct /{linux-headers}/ package in above created package list, the selection of the right package can be done automatically by live-build.
ca: Per tal de fer que el paquet dkms funcioni, s'han d'instal·lar també les capçaleres del nucli per a la variant del nucli de la imatge. En lloc d'enumerar manualment el paquet /{linux-headers}/ correcte en la llista de paquets creat anteriorment, la selecció del paquet adequat es pot fer automàticament amb live-build.

source: 2~using-hdd-image Building and using an HDD image
ca: 2~using-hdd-image Construir i utilitzar una imatge HDD

source: Building an HDD image is similar to an ISO hybrid one in all respects except you specify #{-b hdd}# and the resulting filename is #{live-image-i386.img}# which cannot be burnt to optical media. It is suitable for booting from USB sticks, USB hard drives, and various other portable storage devices. Normally, an ISO hybrid image can be used for this purpose instead, but if you have a BIOS which does not handle hybrid images properly, you need an HDD image.
ca: Construir una imatge HDD és similar a una ISO híbrida en tots els aspectes, excepte que s'especifica #{-b hdd}#, que el nom del fitxer resultant és #{live-image-i386.img}# i que no es pot gravar en medis òptics. És adequada per a arrencar des de dispositius USB, discs durs USB, i altres dispositius d'emmagatzematge portàtils. Normalment, una imatge ISO híbrida es pot utilitzar per a aquest propòsit en el seu lloc, però si el BIOS no maneja adequadament les imatges híbrides, cal utilitzar una imatge HDD.

source: *{Note:}* if you created an ISO hybrid image with the previous example, you will need to clean up your working directory with the #{lb clean}# command (see {The lb clean command}#lb-clean):
ca: *{Nota:}* si s'ha creat una imatge ISO híbrida amb l'exemple anterior, s'haurà de netejar el directori de treball amb l'ordre #{lb clean}# (veure {L'ordre lb clean}#lb-clean):

source: Run the #{lb config}# command as before, except this time specifying the HDD image type:
ca: Executar l'ordre #{lb config}# com abans, excepte que aquesta vegada especificant el tipus d'imatge HDD:

source: Now build the image with the #{lb build}# command:
ca: Ara construir la imatge amb l'ordre #{lb build}#:

source: When the build finishes, a #{live-image-i386.img}# file should be present in the current directory.
ca: Quan la construcció acabi, hauria d'haver un fitxer #{live-image-i386.img}# al directori actual.

source: The generated binary image contains a VFAT partition and the syslinux bootloader, ready to be directly written on a USB device. Once again, using an HDD image is just like using an ISO hybrid one on USB. Follow the instructions in {Using an ISO hybrid live image}#using-iso-hybrid, except use the filename #{live-image-i386.img}# instead of #{live-image-i386.hybrid.iso}#.
ca: La imatge binària generada conté una partició VFAT i el carregador d'arrencada syslinux, llestos per a ser escrits directament a una memòria USB. Un cop més, donat que l'ús d'una imatge HDD és com utilitzar una imatge ISO híbrida en un USB, seguir les instruccions de {Usar una imatge ISO híbrida en viu}#using-iso-hybrid, però amb el nom de fitxer #{live-image-i386.img}# en lloc de #{live-image-i386.hybrid.iso}#.

source: Likewise, to test an HDD image with Qemu, install /{qemu}/ as described above in {Testing an ISO image with QEMU}#testing-iso-with-qemu. Then run #{kvm}# or #{qemu}#, depending on which version your host system needs, specifying #{live-image-i386.img}# as the first hard drive.
ca: Igualment, per a provar una imatge HDD amb Qemu, instal·lar /{qemu}/ com s'ha descrit anteriorment a {Provar una imatge ISO amb QEMU}#testing-iso-with-qemu. A continuació, executar #{kvm}# o #{qemu}#, segons la versió instal·lada al sistema amfitrió, especificant #{live-image-i386.img}# com a primer disc dur.

source: 2~building-netboot-image Building a netboot image
ca: 2~building-netboot-image Construir una imatge netboot

source: The following sequence of commands will create a basic netboot image containing a default live system without X.org. It is suitable for booting over the network.
ca: La següent seqüència d'ordres crearà una imatge netboot bàsica que conté el sistema per defecte de Debian sense X.org. És adequada per a l'arrencada en xarxa.

source: *{Note:}* if you performed any previous examples, you will need to clean up your working directory with the #{lb clean}# command:
ca: *{Nota:}* si s'ha realitzat algun dels exemples anteriors, s'haurà de netejar el directori de treball amb l'ordre #{lb clean}#:

source: In this specific case, a #{lb clean --binary}# would not be enough to clean up the necessary stages. The cause for this is that in netboot setups, a different initramfs configuration needs to be used which live-build performs automatically when building netboot images. Since the initramfs creation belongs to the chroot stage, switching to netboot in an existing build directory means to rebuild the chroot stage too. Therefore, #{lb clean}# (which will remove the chroot stage, too) needs to be used.
ca: En aquest cas concret, un #{lb clean --binary}# no seria suficient per a netejar les etapes necessàries. La causa d'això és que en les configuracions d'arrencada en xarxa, es necessita una configuració initramfs diferent que live-build realitza automàticament quan es construeixen imatges netboot. Ja que la creació del initramfs pertany a l'etapa chroot, fer el canvi a netboot en un directori de construcció existent significa reconstruir l'etapa chroot també. Per tant, s'ha de fer un #{lb clean}# (que eliminarà l'etapa chroot, també)

source: Run the #{lb config}# command as follows to configure your image for netbooting:
ca: Executar l'ordre següent per a configurar la imatge per a arrencar en xarxa:

source: In contrast with the ISO and HDD images, netbooting does not, itself, serve the filesystem image to the client, so the files must be served via NFS. Different network filesystems can be chosen through lb config. The #{--net-root-path}# and #{--net-root-server}# options specify the location and server, respectively, of the NFS server where the filesystem image will be located at boot time. Make sure these are set to suitable values for your network and server.
ca: A diferència de les imatges ISO i HDD, l'arrencada en xarxa no serveix el sistema de fitxers al client, per tant els fitxers han de ser servits a través de NFS. Amb lb config es poden elegir diferents sistemes de fitxers de xarxa. Les opcions #{--net-root-path}# i #{--net-root-server}# especifiquen la ubicació i el servidor, respectivament, del servidor NFS on es troba la imatge del sistema de fitxers a l'hora d'arrencar. Assegurar-se que aquests s'ajusten als valors adequats per a la xarxa i el servidor.

source: In a network boot, the client runs a small piece of software which usually resides on the EPROM of the Ethernet card. This program sends a DHCP request to get an IP address and information about what to do next. Typically, the next step is getting a higher level bootloader via the TFTP protocol. That could be pxelinux, GRUB, or even boot directly to an operating system like Linux.
ca: En l'arrencada en xarxa, el client executa una petita peça de programari que normalment es troba a la EPROM de la targeta Ethernet. Aquest programa envia una petició DHCP per a obtenir una adreça IP i la informació sobre què fer a continuació. Per regla general, el següent pas és aconseguir un carregador d'arrencada de més alt nivell a través del protocol TFTP. Podria ser GRUB, pxelinux o fins i tot arrencar directament a un sistema operatiu com Linux.

source: For example, if you unpack the generated #{live-image-i386.netboot.tar}# archive in the #{/srv/debian-live}# directory, you'll find the filesystem image in #{live/filesystem.squashfs}# and the kernel, initrd and pxelinux bootloader in #{tftpboot/}#.
ca: Per exemple, si es descomprimeix el arxiu #{live-image-i386.netboot.tar}# generat al directori #{/srv/debian-live}#, es trobarà la imatge del sistema de fitxers a #{live/filesystem.squashfs}# i el nucli, initrd i carregador d'arrencada pxelinux a #{tftpboot/}#.

source: We must now configure three services on the server to enable netbooting: the DHCP server, the TFTP server and the NFS server.
ca: Ara hem de configurar els tres serveis al servidor per a l'arrencada en xarxa: el servidor DHCP, servidor TFTP i el servidor NFS.

source: 3~ DHCP server
ca: 3~ Servidor DHCP

source: We must configure our network's DHCP server to be sure to give an IP address to the netbooting client system, and to advertise the location of the PXE bootloader.
ca: S'ha de configurar el servidor DHCP de la xarxa per a assegurar-se que dona una adreça IP per al client del sistema d'arrencada en xarxa, i per a anunciar la ubicació del carregador d'arrencada PXE.

source: Here is an example for inspiration, written for the ISC DHCP server #{isc-dhcp-server}# in the #{/etc/dhcp/dhcpd.conf}# configuration file:
ca: Heus aquí un exemple per a servir d'inspiració, escrit per al servidor ISC DHCP #{isc-dhcp-server}# al fitxer de configuració #{/etc/dhcp/dhcpd.conf}#:

source: 3~ TFTP server
ca: 3~ Servidor TFTP

source: This serves the kernel and initial ramdisk to the system at run time.
ca: Aquest serveix el nucli i el disc ram inicial per al sistema en temps d'execució.

source: You should install the /{tftpd-hpa}/ package. It can serve all files contained inside a root directory, usually #{/srv/tftp}#. To let it serve files inside #{/srv/debian-live/tftpboot}#, run as root the following command:
ca: S'ha d'instal·lar el paquet /{tftpd-hpa}/. Aquest pot servir tots els fitxers continguts dins d'un directori arrel, per regla general #{/srv/tftp}#. Per tal que es serveixin els fitxers dins de #{/srv/debian-live/tftpboot}#, s'ha d'executar com a superusuari la següent ordre:

source: and fill in the new tftp server directory when being asked about it.
ca: i omplir el nou directori del servidor tftp quan ho hàgim de fer.

source: 3~ NFS server
ca: 3~ Servidor NFS

source: Once the guest computer has downloaded and booted a Linux kernel and loaded its initrd, it will try to mount the Live filesystem image through a NFS server.
ca: Un cop l'ordinador ha descarregat, ha arrencat el nucli de Linux i ha carregat el initrd, intentarà muntar la imatge del sistema de fitxers en viu a través d'un servidor NFS.

source: You need to install the /{nfs-kernel-server}/ package.
ca: S'ha d'instal·lar el paquet /{nfs-kernel-server}/

source: Then, make the filesystem image available through NFS by adding a line like the following to #{/etc/exports}#:
ca: Llavors, fer que la imatge del sistema de fitxers estigui disponible a través de NFS afegint una línia com la següent a #{/etc/exports}#:

source: and tell the NFS server about this new export with the following command:
ca: i informar al servidor NFS sobre aquesta nova exportació amb la següent ordre:

source: Setting up these three services can be a little tricky. You might need some patience to get all of them working together. For more information, see the syslinux wiki at http://www.syslinux.org/wiki/index.php/PXELINUX or the Debian Installer Manual's TFTP Net Booting section at http://d-i.alioth.debian.org/manual/en.i386/ch04s05.html. They might help, as their processes are very similar.
ca: La configuració d'aquests tres serveis pot ser una mica difícil. És possible que es necessiti una mica de paciència per a aconseguir que tots tres funcionin plegats. Per a obtenir més informació, veure el wiki de syslinux a http://www.syslinux.org/wiki/index.php/PXELINUX o la secció TFTP Net Booting al Manual del Instal·lador de Debian a http://d-i.alioth.debian.org/manual/ca.i386/ch04s05.html. Això pot ajudar, ja que els seus processos són molt similars.

source: 3~ Netboot testing HowTo
ca: 3~ Com provar l'arrencada en xarxa

source: Netboot image creation is made easy with live-build, but testing the images on physical machines can be really time consuming.
ca: La creació d'imatges d'arrencada en xarxa es senzilla amb live-build, però provar les imatges en màquines físiques pot costar molt de temps.

source: To make our life easier, we can use virtualization.
ca: Per a fer la nostra vida més fàcil, podem utilitzar la virtualització.

source: _* Install /{qemu}/, /{bridge-utils}/, /{sudo}/.
ca: _* Instal·lar /{qemu}/, /{bridge-utils}/, /{sudo}/.

source: Edit #{/etc/qemu-ifup}#:
ca: Editar #{/etc/qemu-ifup}#:

source: Get, or build a #{grub-floppy-netboot}#.
ca: Descarregar o crear un #{grub-floppy-netboot}#.

source: Launch #{qemu}# with "#{-net nic,vlan=0 -net tap,vlan=0,ifname=tun0}#"
ca: Llançar #{qemu}# amb "#{-net nic,vlan=0 -net tap,vlan=0,ifname=tun0}#"

source: Webbooting is a convenient way of retrieving and booting live systems using the internet as a means. The requirements for webbooting are very few. On the one hand, you need a medium with a bootloader, an initial ramdisk and a kernel. On the other hand, a web server to store the squashfs files which contain the filesystem.
ca: Webbooting és una manera convenient d'aconseguir i arrencar sistemes vius utilitzant internet com un mitjà. Els requisits per fer webbooting són molt pocs. D'una banda, es necessita un dispositiu amb un carregador d'arrencada, un disc ram inicial i un nucli. D'altra banda, un servidor web per emmagatzemar els fitxers squashfs que contenen el sistema de fitxers.

source: 3~ Getting the webboot files
ca: 3~ Obtenir els fitxers webboot

source: As usual, you can build the images yourself or use the prebuilt files, which are available on the project's homepage at http://live-systems.org/. Using prebuilt images would be handy for doing initial testing until one can fine tune their own needs. If you have built a live image you will find the files needed for webbooting in the build directory under #{binary/live/}#. The files are called #{vmlinuz}#, #{initrd.img}# and #{filesystem.squashfs}#.
ca: Com de costum, es pot construir les imatges un mateix o utilitzar els fitxers prefabricats, que estan disponibles a la pàgina principal del projecte a http://live-systems.org/. Les imatges prefabricades són adients per fer proves inicials fins que un pugui afinar les seves pròpies necessitats. Si ja s'ha construït una imatge en viu, els fitxers necessaris pel webbooting es troben al directori de construcció sota #{binary/live/}#. Els fitxers s'anomenen #{vmlinuz}#, #{initrd.img}# i #{filesystem.squashfs}#.

source: It is also possible to extract those files from an already existing iso image. In order to achieve that, loopback mount the image as follows:
ca: També és possible extreure els fitxers d'una imatge iso ja existent. Per tal d'aconseguir això, muntar la imatge de la següent manera:

source: The files are to be found under the #{live/}# directory. In this specific case, it would be #{/mnt/live/}#. This method has the disadvantage that you need to be root to be able to mount the image. However, it has the advantage that it is easily scriptable and thus, easily automatized.
ca: Els fitxers es troben sota el directori #{live/}#. En aquest cas concret, seria #{/mnt/live/}#. Aquest mètode té el desavantatge que cal ser root per poder muntar la imatge. No obstant això, té l'avantatge que és fàcil de fer amb un script, i per tant es pot automatitzar.

source: But undoubtedly, the easiest way of extracting the files from an iso image and uploading it to the web server at the same time, is using the midnight commander or /{mc}/. If you have the /{genisoimage}/ package installed, the two-pane file manager allows you to browse the contents of an iso file in one pane and upload the files via ftp in the other pane. Even though this method requires manual work, it does not require root privileges.
ca: Però, sens dubte, la forma més fàcil d'extreure els fitxers d'una imatge iso i pujar-los al servidor web a la vegada, és utilitzant el midnight commander o /{mc}/. Si es té el paquet /{genisoimage}/ instal·lat, aquest gestor de fitxers de dos panells permet examinar el contingut d'un arxiu iso en un panell i pujar els fitxers via ftp en l'altre panell. Tot i que aquest mètode requereix fer un treball manual, no requereix privilegis de root.

source: 3~ Booting webboot images
ca: 3~ Arrencar imatges webboot

source: While some users will prefer virtualization to test webbooting, we refer to real hardware here to match the following possible use case which should only be considered as an example.
ca: Mentre que alguns usuaris prefereixen utilitzar la virtualització per prova el webbooting, en aquest cas utilitzem maquinari real perquè coincideixi amb el següent cas d'ús, que només ha de ser considerat com un exemple.
